### 오라클 데이터 베이스 연결

In [4]:
import cx_Oracle

In [5]:
oracle_dsn=cx_Oracle.makedsn(host="localhost",port=1521,sid="xe")
oracle_dsn

'(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1521))(CONNECT_DATA=(SID=xe)))'

In [6]:
conn = cx_Oracle.connect(dsn=oracle_dsn,user="hr", password="hr")
conn

In [7]:
cursor=conn.cursor()

In [8]:
sql="select first_name, last_name from employees"
cursor.execute(sql)
for name in cursor:
    print(name)

('Ellen', 'Abel')
('Sundar', 'Ande')
('Mozhe', 'Atkinson')
('David', 'Austin')
('Hermann', 'Baer')
('Shelli', 'Baida')
('Amit', 'Banda')
('Elizabeth', 'Bates')
('Sarah', 'Bell')
('David', 'Bernstein')
('Laura', 'Bissot')
('Harrison', 'Bloom')
('Alexis', 'Bull')
('Anthony', 'Cabrio')
('Gerald', 'Cambrault')
('Nanette', 'Cambrault')
('John', 'Chen')
('Kelly', 'Chung')
('Karen', 'Colmenares')
('Curtis', 'Davies')
('Lex', 'De Haan')
('Julia', 'Dellinger')
('Jennifer', 'Dilly')
('Louise', 'Doran')
('Bruce', 'Ernst')
('Alberto', 'Errazuriz')
('Britney', 'Everett')
('Daniel', 'Faviet')
('Pat', 'Fay')
('Kevin', 'Feeney')
('Jean', 'Fleaur')
('Tayler', 'Fox')
('Adam', 'Fripp')
('Timothy', 'Gates')
('Ki', 'Gee')
('Girard', 'Geoni')
('William', 'Gietz')
('Douglas', 'Grant')
('Kimberely', 'Grant')
('Nancy', 'Greenberg')
('Danielle', 'Greene')
('Peter', 'Hall')
('Michael', 'Hartstein')
('Shelley', 'Higgins')
('Guy', 'Himuro')
('Alexander', 'Hunold')
('Alyssa', 'Hutton')
('Charles', 'Johnson')
('Vance', 'Jones')
('Payam', 'Kaufling')
('Alexander', 'Khoo')
('Janette', 'King')
('Steven', 'King')
('Neena', 'Kochhar')
('Sundita', 'Kumar')
('Renske', 'Ladwig')
('James', 'Landry')
('David', 'Lee')
('Jack', 'Livingston')
('Diana', 'Lorentz')
('Jason', 'Mallin')
('Steven', 'Markle')
('James', 'Marlow')
('Mattea', 'Marvins')
('Randall', 'Matos')
('Susan', 'Mavris')
('Samuel', 'McCain')
('Allan', 'McEwen')
('Irene', 'Mikkilineni')
('Kevin', 'Mourgos')
('Julia', 'Nayer')
('Donald', 'OConnell')
('Christopher', 'Olsen')
('TJ', 'Olson')
('Lisa', 'Ozer')
('Karen', 'Partners')
('Valli', 'Pataballa')
('Joshua', 'Patel')
('Randall', 'Perkins')
('Hazel', 'Philtanker')
('Luis', 'Popp')
('Trenna', 'Rajs')
('Den', 'Raphaely')
('Michael', 'Rogers')
('John', 'Russell')
('Nandita', 'Sarchand')
('Ismael', 'Sciarra')
('John', 'Seo')
('Sarath', 'Sewall')
('Lindsey', 'Smith')
('William', 'Smith')
('Stephen', 'Stiles')
('Martha', 'Sullivan')
('Patrick', 'Sully')
('Jonathon', 'Taylor')
('Winston', 'Taylor')
('Sigal', 'Tobias')
('Peter', 'Tucker')
('Oliver', 'Tuvault')
('Jose Manuel', 'Urman')
('Peter', 'Vargas')
('Clara', 'Vishney')
('Shanta', 'Vollman')
('Alana', 'Walsh')
('Matthew', 'Weiss')
('Jennifer', 'Whalen')
('Eleni', 'Zlotkey')

In [12]:
cursor.execute("select * from employees where department_id=:dept_id",
               {"dept_id":50})
for emp in cursor:
                print(emp)

(120, 'Matthew', 'Weiss', 'MWEISS', '650.123.1234', datetime.datetime(2004, 7, 18, 0, 0), 'ST_MAN', 8000.0, None, 100, 50)
(121, 'Adam', 'Fripp', 'AFRIPP', '650.123.2234', datetime.datetime(2005, 4, 10, 0, 0), 'ST_MAN', 8200.0, None, 100, 50)
(122, 'Payam', 'Kaufling', 'PKAUFLIN', '650.123.3234', datetime.datetime(2003, 5, 1, 0, 0), 'ST_MAN', 7900.0, None, 100, 50)
(123, 'Shanta', 'Vollman', 'SVOLLMAN', '650.123.4234', datetime.datetime(2005, 10, 10, 0, 0), 'ST_MAN', 6500.0, None, 100, 50)
(124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', datetime.datetime(2007, 11, 16, 0, 0), 'ST_MAN', 5800.0, None, 100, 50)
(125, 'Julia', 'Nayer', 'JNAYER', '650.124.1214', datetime.datetime(2005, 7, 16, 0, 0), 'ST_CLERK', 3200.0, None, 120, 50)
(126, 'Irene', 'Mikkilineni', 'IMIKKILI', '650.124.1224', datetime.datetime(2006, 9, 28, 0, 0), 'ST_CLERK', 2700.0, None, 120, 50)
(127, 'James', 'Landry', 'JLANDRY', '650.124.1334', datetime.datetime(2007, 1, 14, 0, 0), 'ST_CLERK', 2400.0, None, 120, 50)
(128, 'Steven', 'Markle', 'SMARKLE', '650.124.1434', datetime.datetime(2008, 3, 8, 0, 0), 'ST_CLERK', 2200.0, None, 120, 50)
(129, 'Laura', 'Bissot', 'LBISSOT', '650.124.5234', datetime.datetime(2005, 8, 20, 0, 0), 'ST_CLERK', 3300.0, None, 121, 50)
(130, 'Mozhe', 'Atkinson', 'MATKINSO', '650.124.6234', datetime.datetime(2005, 10, 30, 0, 0), 'ST_CLERK', 2800.0, None, 121, 50)
(131, 'James', 'Marlow', 'JAMRLOW', '650.124.7234', datetime.datetime(2005, 2, 16, 0, 0), 'ST_CLERK', 2500.0, None, 121, 50)
(132, 'TJ', 'Olson', 'TJOLSON', '650.124.8234', datetime.datetime(2007, 4, 10, 0, 0), 'ST_CLERK', 2100.0, None, 121, 50)
(133, 'Jason', 'Mallin', 'JMALLIN', '650.127.1934', datetime.datetime(2004, 6, 14, 0, 0), 'ST_CLERK', 3300.0, None, 122, 50)
(134, 'Michael', 'Rogers', 'MROGERS', '650.127.1834', datetime.datetime(2006, 8, 26, 0, 0), 'ST_CLERK', 2900.0, None, 122, 50)
(135, 'Ki', 'Gee', 'KGEE', '650.127.1734', datetime.datetime(2007, 12, 12, 0, 0), 'ST_CLERK', 2400.0, None, 122, 50)
(136, 'Hazel', 'Philtanker', 'HPHILTAN', '650.127.1634', datetime.datetime(2008, 2, 6, 0, 0), 'ST_CLERK', 2200.0, None, 122, 50)
(137, 'Renske', 'Ladwig', 'RLADWIG', '650.121.1234', datetime.datetime(2003, 7, 14, 0, 0), 'ST_CLERK', 3600.0, None, 123, 50)
(138, 'Stephen', 'Stiles', 'SSTILES', '650.121.2034', datetime.datetime(2005, 10, 26, 0, 0), 'ST_CLERK', 3200.0, None, 123, 50)
(139, 'John', 'Seo', 'JSEO', '650.121.2019', datetime.datetime(2006, 2, 12, 0, 0), 'ST_CLERK', 2700.0, None, 123, 50)
(140, 'Joshua', 'Patel', 'JPATEL', '650.121.1834', datetime.datetime(2006, 4, 6, 0, 0), 'ST_CLERK', 2500.0, None, 123, 50)
(141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', datetime.datetime(2003, 10, 17, 0, 0), 'ST_CLERK', 3500.0, None, 124, 50)
(142, 'Curtis', 'Davies', 'CDAVIES', '650.121.2994', datetime.datetime(2005, 1, 29, 0, 0), 'ST_CLERK', 3100.0, None, 124, 50)
(143, 'Randall', 'Matos', 'RMATOS', '650.121.2874', datetime.datetime(2006, 3, 15, 0, 0), 'ST_CLERK', 2600.0, None, 124, 50)
(144, 'Peter', 'Vargas', 'PVARGAS', '650.121.2004', datetime.datetime(2006, 7, 9, 0, 0), 'ST_CLERK', 2500.0, None, 124, 50)
(180, 'Winston', 'Taylor', 'WTAYLOR', '650.507.9876', datetime.datetime(2006, 1, 24, 0, 0), 'SH_CLERK', 3200.0, None, 120, 50)
(181, 'Jean', 'Fleaur', 'JFLEAUR', '650.507.9877', datetime.datetime(2006, 2, 23, 0, 0), 'SH_CLERK', 3100.0, None, 120, 50)
(182, 'Martha', 'Sullivan', 'MSULLIVA', '650.507.9878', datetime.datetime(2007, 6, 21, 0, 0), 'SH_CLERK', 2500.0, None, 120, 50)
(183, 'Girard', 'Geoni', 'GGEONI', '650.507.9879', datetime.datetime(2008, 2, 3, 0, 0), 'SH_CLERK', 2800.0, None, 120, 50)
(184, 'Nandita', 'Sarchand', 'NSARCHAN', '650.509.1876', datetime.datetime(2004, 1, 27, 0, 0), 'SH_CLERK', 4200.0, None, 121, 50)
(185, 'Alexis', 'Bull', 'ABULL', '650.509.2876', datetime.datetime(2005, 2, 20, 0, 0), 'SH_CLERK', 4100.0, None, 121, 50)
(186, 'Julia', 'Dellinger', 'JDELLING', '650.509.3876', datetime.datetime(2006, 6, 24, 0, 0), 'SH_CLERK', 3400.0, None, 121, 50)
(187, 'Anthony', 'Cabrio', 'ACABRIO', '650.509.4876', datetime.datetime(2007, 2, 7, 0, 0), 'SH_CLERK', 3000.0, None, 121, 50)
(188, 'Kelly', 'Chung', 'KCHUNG', '650.505.1876', datetime.datetime(2005, 6, 14, 0, 0), 'SH_CLERK', 3800.0, None, 122, 50)
(189, 'Jennifer', 'Dilly', 'JDILLY', '650.505.2876', datetime.datetime(2005, 8, 13, 0, 0), 'SH_CLERK', 3600.0, None, 122, 50)
(190, 'Timothy', 'Gates', 'TGATES', '650.505.3876', datetime.datetime(2006, 7, 11, 0, 0), 'SH_CLERK', 2900.0, None, 122, 50)
(191, 'Randall', 'Perkins', 'RPERKINS', '650.505.4876', datetime.datetime(2007, 12, 19, 0, 0), 'SH_CLERK', 2500.0, None, 122, 50)
(192, 'Sarah', 'Bell', 'SBELL', '650.501.1876', datetime.datetime(2004, 2, 4, 0, 0), 'SH_CLERK', 4000.0, None, 123, 50)
(193, 'Britney', 'Everett', 'BEVERETT', '650.501.2876', datetime.datetime(2005, 3, 3, 0, 0), 'SH_CLERK', 3900.0, None, 123, 50)
(194, 'Samuel', 'McCain', 'SMCCAIN', '650.501.3876', datetime.datetime(2006, 7, 1, 0, 0), 'SH_CLERK', 3200.0, None, 123, 50)
(195, 'Vance', 'Jones', 'VJONES', '650.501.4876', datetime.datetime(2007, 3, 17, 0, 0), 'SH_CLERK', 2800.0, None, 123, 50)
(196, 'Alana', 'Walsh', 'AWALSH', '650.507.9811', datetime.datetime(2006, 4, 24, 0, 0), 'SH_CLERK', 3100.0, None, 124, 50)
(197, 'Kevin', 'Feeney', 'KFEENEY', '650.507.9822', datetime.datetime(2006, 5, 23, 0, 0), 'SH_CLERK', 3000.0, None, 124, 50)
(198, 'Donald', 'OConnell', 'DOCONNEL', '650.507.9833', datetime.datetime(2007, 6, 21, 0, 0), 'SH_CLERK', 2600.0, None, 124, 50)
(199, 'Douglas', 'Grant', 'DGRANT', '650.507.9844', datetime.datetime(2008, 1, 13, 0, 0), 'SH_CLERK', 2600.0, None, 124, 50)

In [17]:
cursor.execute("select * from employees")

In [18]:
from pandas import DataFrame

In [19]:
#커서에서 데이터를 추출해 데이터프레임 객체로 생성
emp_df=DataFrame(cursor.fetchall())
cursor.rowcount

107

In [20]:
#데이터프레임의 상위 5개 행을 출력합니다.
emp_df.head()

,0,1,2,3,4,5,6,7,8,9,10
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0

In [23]:
# columns를 가져와서 컬럼을 넣어준다.
col_names=[row[0] for row in cursor.description]
emp_df.columns = col_names
emp_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0

### Maria db연결

In [24]:
# 마리아 홈페이지에서 먼저 다운로드 받는다.
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [46]:
import pymysql

In [47]:
# 마리아 db에서 mydb 데이터베이스 생성 후 권한자를 생성하였다
connection = pymysql.connect(host="localhost",port=3306,db="mydb",user='root',passwd='mariadb',charset='utf8',autocommit=True)

In [48]:
connection

In [50]:
cursor=connection.cursor()
sql="select * from employees where department_id=%s"
# sql="select * from employees"
cursor.execute(sql,(50,))
# cursor.execute(sql)
result=cursor.fetchall()
for emp in result:
    print(emp)

(124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', datetime.date(2000, 1, 1), 'ST_MAN', Decimal('5800.00'), None, 100, 50)
(141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', datetime.date(2000, 1, 1), 'ST_CLERK', Decimal('3500.00'), None, 124, 50)
(142, 'Curtis', 'Davies', 'CDAVIES', '650.121.2994', datetime.date(2000, 1, 1), 'ST_CLERK', Decimal('3100.00'), None, 124, 50)
(143, 'Randall', 'Matos', 'RMATOS', '650.121.2874', datetime.date(2000, 1, 1), 'ST_CLERK', Decimal('4187.33'), None, 124, 50)
(144, 'Peter', 'Vargas', 'PVARGAS', '650.121.2004', datetime.date(2000, 1, 1), 'ST_CLERK', Decimal('2500.00'), None, 124, 50)

In [53]:
cursor=connection.cursor()
sql="update employees set salary=salary*1.1 where last_name=%s"
cursor.execute(sql,"Matos")

1